app/controllers/availabilities_controller.rb

  def index
    @availabilities = Availability.find(:all, :order => "start_time")
---
SELECT * FROM `availabilities` WHERE (developer != 'Aslak' and start_time < '2009-10-14 19:40:00' and end_time > '2009-10-14 00:00:00' and (project = 'Cucumber' or project = ''))

  def show
    @availability = Availability.find(params[:id])
---
SELECT * FROM `availabilities` WHERE (developer != 'Aslak' and start_time < '2009-10-14 19:40:00' and end_time > '2009-10-14 00:00:00' and (project = 'http://github.com/aslakhellesoy/cucumber' or project = ''))

  def pairs
    @availability = Availability.find(params[:id])
    @possible_pairs = PossiblePair.find(:all, :conditions => ["availability1 = :availablity_id",{:availablity_id => @availability.id}])
---
SELECT * FROM `availabilities` WHERE (developer != 'Dave' and start_time < '2009-10-15 00:00:00' and end_time > '2009-10-14 16:00:00')
SELECT * FROM `possible_pairs` WHERE (availability1 = 3)

  def edit
    @availability = Availability.find(params[:id])
---
SELECT "availabilities".* FROM "availabilities" WHERE "availabilities"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @availability = Availability.new(params[:availability])

    respond_to do |format|
      if @availability.save
---
INSERT INTO `availabilities` (`updated_at`, `project`, `contact`, `developer`, `start_time`, `end_time`, `created_at`) VALUES('2009-10-16 16:35:28', 'Cucumber', '', 'Aslak', '2009-10-14 00:00:00', '2009-10-14 19:40:00', '2009-10-16 16:35:28')

  def update
    @availability = Availability.find(params[:id])

    respond_to do |format|
      if @availability.update_attributes(params[:availability])
---
SELECT * FROM `availabilities` WHERE (`availabilities`.`id` = 4)
UPDATE `availabilities` SET `contact` = 'http://github.com/bob\"><script> alert(1)</script>', `updated_at` = '2009-10-16 15:00:04' WHERE `id` = 3

  def destroy
    @availability = Availability.find(params[:id])
    @availability.destroy
---
SELECT "availabilities".* FROM "availabilities" WHERE "availabilities"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "availabilities" WHERE "availabilities"."id" = ?  [["id", 1]]