app/controllers/pairs_controller.rb

  def suggest

    return unless require_user
    pair = Pair.find(params[:id])
---
SELECT "pairs".* FROM "pairs" WHERE (availability_id = 2 and available_pair_id = 1)

  def cancel

    return unless require_user
    pair = Pair.find(params[:id])
---
SELECT "pairs".* FROM "pairs" WHERE (availability_id = 2 and available_pair_id = 1)