app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'LarryDavid'
SELECT "availabilities".* FROM "availabilities" WHERE (user_id = 1 and end_time > '2011-09-11 11:14:16.784332')
---
  def index
    @user = User.find(:all,:conditions => {:username => params[:id]})[0]
    if @user.nil?
      redirect_to root_url
      return
    end
    @availabilities = Availability.find(:all,
                                        :conditions => ["user_id = :user_id and end_time > :end_time" ,
                                                        {:user_id => @user.id,:end_time => Time.now.utc}])