app/views/availabilities/_atom.erb

SELECT "pairs".* FROM "pairs" WHERE "pairs"."availability_id" = 1
SELECT "users".* FROM "users" WHERE "users"."username" = 'LarryDavid'
---
    <content type="html">
        <![CDATA[
        <% if availability.pairs.length == 0 %>
            No developers are available to pair on <%= project_link(availability) %> with <%=h availability.user.username%> on <a href="<%= http_root %>/availabilities/<%=h availability.id %>"><%=h display_when(availability) %></a>.
        <% else %>
            The following developers are available to pair on <%= project_link(availability) %> with <%=h availability.user.username %> on <a href="<%= http_root %>/availabilities/<%=h availability.id %>"><%=h display_when(availability) %></a>:
            <ul>
              <% availability.pairs.each do |pair| %>
              <li><strong><%=h display_duration(pair,true) %></strong> from <strong><%=h display_when_time(pair) %></strong> - <strong><%= h pair.user.username %></strong> on <strong><%=h display_project(pair) %></strong> - Status: <strong><%= display_pair_status(pair) %></strong> - Tags: <strong><%= pair.tags %></strong> (updated: <%= display_date_time(pair.updated_at)%>)</li>
              <% end %>
            </ul>
        <% end %>
        ]]>