app/views/availabilities/edit.html.erb

    <%= f.label :tags, 'Tags' %>(optional, comma seperated) - e.g. programming languages, spoken languages, interests, trends<br />
    <%= f.text_field(:tags, :value => @availability.tags.join(','))  %>
---
SELECT "tags".* FROM "tags" INNER JOIN "availabilities_tags_links" ON "tags"."id" = "availabilities_tags_links"."tag_id" WHERE "availabilities_tags_links"."availability_id" = 1