app/views/availabilities/show.html.erb

<h1><%=h @availability.developer %> is available to pair on <%= project_link(@availability) %> for <span class="duration"><%= display_duration(@availability) %></span> from <span class="time"><%=h display_when(@availability) %></span></h1>
<% if @availability.pairs.length == 0 %>
---
SELECT "pairs".* FROM "pairs" WHERE "pairs"."availability_id" = 2